---
type: Blend
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# Blend

`Autodesk.Revit.DB.Blend` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVertexConnectionMap | — | `public VertexIndexPairArray GetVertexConnectionMap ()` |
| Method | SetVertexConnectionMap | — | `public void SetVertexConnectionMap ( VertexIndexPairArray vertexMap )` |
| Property | BottomOffset | — | `public double BottomOffset { get ; set ; }` |
| Property | BottomProfile | — | `public CurveArrArray BottomProfile { get ; }` |
| Property | BottomSketch | — | `public Sketch BottomSketch { get ; }` |
| Property | Parameter | — | `` |
| Property | TopOffset | — | `public double TopOffset { get ; set ; }` |
| Property | TopProfile | — | `public CurveArrArray TopProfile { get ; }` |
| Property | TopSketch | — | `public Sketch TopSketch { get ; }` |